#######################################################
#                                                     
#  by Sandro Bonacini
#  CERN PH/ESE/ME
#  Created on 10/07/2009
#                                                     
#######################################################

set sdc_version 1.3
#create_clock [get_ports {CK}]  -name CK -period 40 -waveform {0 20}
create_clock [get_ports {clk}]  -name clk1 -period 40 -waveform {0 20}
#create_clock [get_ports {clk2}]  -name clk2 -period 40 -waveform {0 20}
#create_clock [get_ports {clk3}]  -name clk3 -period 40 -waveform {0 20}
set_clock_transition  0.2 [all_clocks]

set_load 0.15 [all_outputs]

set_max_fanout 0.001 [all_inputs]
set_max_transition 0.5 [current_design]
set_input_transition 0.5  [all_inputs]
set_clock_uncertainty 0.25 -setup -from [all_clocks] -to [all_clocks] 

set_input_delay 2 [all_inputs]
set_output_delay 2 [all_outputs]

set_dont_touch PVDD1CDG
set_dont_touch PVDD2CDG
set_dont_touch PVSS1CDG
set_dont_touch PVSS2CDG
set_dont_touch PVDD1ANA
set_dont_touch PVSS1ANA

#set_false_path -from [get_ports {SCAN_MODE}]

#set_dont_use GDFCNQD1 false
#set_dont_use GDFQD1 false
#set_dont_use GSDFCNQD1 false

#set_dont_use DFKCSND1
#set_dont_use DFCND1
#set_dont_use DFQD1
#set_dont_use LHCND1
#set_dont_use DFSND1

#set_dont_use AN2D0
#set_dont_use AN2D1
#set_dont_use AN3D0
#set_dont_use AN3D1
#set_dont_use AN4D0
#set_dont_use AN4D1
#set_dont_use AO211D0
#set_dont_use AO21D0
#set_dont_use AO221D0
#set_dont_use AO222D0
#set_dont_use AO22D0
#set_dont_use AO31D0
#set_dont_use AO32D0
#set_dont_use AO33D0
#set_dont_use AOI211D0
#set_dont_use AOI211XD0
#set_dont_use AOI21D0
#set_dont_use AOI221D0
#set_dont_use AOI222D0
#set_dont_use AOI22D0
#set_dont_use AOI31D0
#set_dont_use AOI32D0
#set_dont_use AOI33D0
#set_dont_use BENCD1
#set_dont_use BENCD2
#set_dont_use BENCD4
#set_dont_use BHD
#set_dont_use BMLD1
#set_dont_use BMLD2
#set_dont_use BMLD4
#set_dont_use BUFFD0
#set_dont_use BUFFD1
#set_dont_use BUFTD0
#set_dont_use BUFTD1
#set_dont_use BUFTD2
#set_dont_use BUFTD3
#set_dont_use BUFTD4
#set_dont_use BUFTD6
#set_dont_use BUFTD8
#set_dont_use BUFTD12
#set_dont_use BUFTD16
#set_dont_use BUFTD20
#set_dont_use BUFTD24
#set_dont_use CKAN2D0
#set_dont_use CKAN2D1
#set_dont_use CKAN2D2
#set_dont_use CKAN2D4
#set_dont_use CKAN2D8
#set_dont_use CKBD0
#set_dont_use CKBD1
#set_dont_use CKBD2
#set_dont_use CKBD3
#set_dont_use CKBD4
#set_dont_use CKBD6
#set_dont_use CKBD8
#set_dont_use CKBD12
#set_dont_use CKBD16
#set_dont_use CKBD20
#set_dont_use CKLHQD1
#set_dont_use CKLHQD2
#set_dont_use CKLHQD3
#set_dont_use CKLHQD4
#set_dont_use CKLHQD6
#set_dont_use CKLHQD8
#set_dont_use CKLHQD12
#set_dont_use CKLHQD16
#set_dont_use CKLHQD20
#set_dont_use CKLHQD24
#set_dont_use CKLNQD1
#set_dont_use CKLNQD2
#set_dont_use CKLNQD3
#set_dont_use CKLNQD4
#set_dont_use CKLNQD6
#set_dont_use CKLNQD8
#set_dont_use CKLNQD12
#set_dont_use CKLNQD16
#set_dont_use CKLNQD20
#set_dont_use CKLNQD24
#set_dont_use CKMUX2D0
#set_dont_use CKMUX2D1
#set_dont_use CKMUX2D2
#set_dont_use CKMUX2D4
#set_dont_use CKND0
#set_dont_use CKND1
#set_dont_use CKND2
#set_dont_use CKND3
#set_dont_use CKND4
#set_dont_use CKND6
#set_dont_use CKND8
#set_dont_use CKND12
#set_dont_use CKND16
#set_dont_use CKND20
#set_dont_use CKND24
#set_dont_use CKND2D0
#set_dont_use CKND2D1
#set_dont_use CKND2D2
#set_dont_use CKND2D3
#set_dont_use CKND2D4
#set_dont_use CKND2D8
#set_dont_use CKXOR2D0
#set_dont_use CKXOR2D1
#set_dont_use CKXOR2D2
#set_dont_use CKXOR2D4
#set_dont_use CMPE42D1
#set_dont_use CMPE42D2
#set_dont_use DCAP
#set_dont_use DCAP4
#set_dont_use DCAP8
#set_dont_use DCAP16
#set_dont_use DCAP32
#set_dont_use DCAP64
#set_dont_use DEL02
#set_dont_use DEL1
#set_dont_use DEL2
#set_dont_use DEL3
#set_dont_use DEL4
#set_dont_use DFCND2
#set_dont_use DFCND4
#set_dont_use DFCNQD1
#set_dont_use DFCNQD2
#set_dont_use DFCNQD4
#set_dont_use DFCSND1
#set_dont_use DFCSND2
#set_dont_use DFCSND4
#set_dont_use DFCSNQD1
#set_dont_use DFCSNQD2
#set_dont_use DFCSNQD4
#set_dont_use DFD1
#set_dont_use DFD2
#set_dont_use DFD4
#set_dont_use DFKCND1
#set_dont_use DFKCND2
#set_dont_use DFKCND4
#set_dont_use DFKCNQD1
#set_dont_use DFKCNQD2
#set_dont_use DFKCNQD4
#set_dont_use DFKCSND2
#set_dont_use DFKCSND4
#set_dont_use DFKSND1
#set_dont_use DFKSND2
#set_dont_use DFKSND4
#set_dont_use DFNCND1
#set_dont_use DFNCND2
#set_dont_use DFNCND4
#set_dont_use DFNCSND1
#set_dont_use DFNCSND2
#set_dont_use DFNCSND4
#set_dont_use DFND1
#set_dont_use DFND2
#set_dont_use DFND4
#set_dont_use DFNSND1
#set_dont_use DFNSND2
#set_dont_use DFNSND4
#set_dont_use DFQD2
#set_dont_use DFQD4
#set_dont_use DFSND2
#set_dont_use DFSND4
#set_dont_use DFSNQD1
#set_dont_use DFSNQD2
#set_dont_use DFSNQD4
#set_dont_use DFXD1
#set_dont_use DFXD2
#set_dont_use DFXD4
#set_dont_use DFXQD1
#set_dont_use DFXQD2
#set_dont_use DFXQD4
#set_dont_use EDFCND1
#set_dont_use EDFCND2
#set_dont_use EDFCND4
#set_dont_use EDFCNQD1
#set_dont_use EDFCNQD2
#set_dont_use EDFCNQD4
#set_dont_use EDFD1
#set_dont_use EDFD2
#set_dont_use EDFD4
#set_dont_use EDFKCND1
#set_dont_use EDFKCND2
#set_dont_use EDFKCND4
#set_dont_use EDFKCNQD1
#set_dont_use EDFKCNQD2
#set_dont_use EDFKCNQD4
#set_dont_use EDFQD1
#set_dont_use EDFQD2
#set_dont_use EDFQD4
#set_dont_use FA1D0
#set_dont_use FA1D1
#set_dont_use FA1D2
#set_dont_use FA1D4
#set_dont_use FCICIND1
#set_dont_use FCICIND2
#set_dont_use FCICOND1
#set_dont_use FCICOND2
#set_dont_use FCSICIND1
#set_dont_use FCSICIND2
#set_dont_use FCSICOND1
#set_dont_use FCSICOND2
#set_dont_use FICIND1
#set_dont_use FICIND2
#set_dont_use FICOND1
#set_dont_use FICOND2
#set_dont_use FIICOND1
#set_dont_use FIICOND2
#set_dont_use HA1D0
#set_dont_use HA1D1
#set_dont_use HA1D2
#set_dont_use HA1D4
#set_dont_use HCOSCIND1
#set_dont_use HCOSCIND2
#set_dont_use HCOSCOND1
#set_dont_use HCOSCOND2
#set_dont_use HICIND1
#set_dont_use HICIND2
#set_dont_use HICOND1
#set_dont_use HICOND2
#set_dont_use IAO21D0
#set_dont_use IAO21D1
#set_dont_use IAO22D0
#set_dont_use IAO22D1
#set_dont_use IAO22D2
#set_dont_use IAO22D4
#set_dont_use IIND4D0
#set_dont_use IIND4D1
#set_dont_use IINR4D0
#set_dont_use IINR4D1
#set_dont_use IINR4D4
#set_dont_use IND2D0
#set_dont_use IND2D1
#set_dont_use IND3D0
#set_dont_use IND3D1
#set_dont_use IND4D0
#set_dont_use IND4D1
#set_dont_use INR2D0
#set_dont_use INR2D1
#set_dont_use INR2XD0
#set_dont_use INR2XD1
#set_dont_use INR2XD2
#set_dont_use INR3D0
#set_dont_use INR4D0
#set_dont_use INR4D1
#set_dont_use INVD0
#set_dont_use IOA21D0
#set_dont_use IOA21D1
#set_dont_use IOA22D0
#set_dont_use IOA22D1
#set_dont_use IOA22D2
#set_dont_use IOA22D4
#set_dont_use LHCND2
#set_dont_use LHCND4
#set_dont_use LHCNDD1
#set_dont_use LHCNDD2
#set_dont_use LHCNDD4
#set_dont_use LHCNDQD1
#set_dont_use LHCNDQD2
#set_dont_use LHCNDQD4
#set_dont_use LHCNQD1
#set_dont_use LHCNQD2
#set_dont_use LHCNQD4
#set_dont_use LHCSND1
#set_dont_use LHCSND2
#set_dont_use LHCSND4
#set_dont_use LHCSNDD1
#set_dont_use LHCSNDD2
#set_dont_use LHCSNDD4
#set_dont_use LHCSNDQD1
#set_dont_use LHCSNDQD2
#set_dont_use LHCSNDQD4
#set_dont_use LHCSNQD1
#set_dont_use LHCSNQD2
#set_dont_use LHCSNQD4
#set_dont_use LHD1
#set_dont_use LHD2
#set_dont_use LHD4
#set_dont_use LHQD1
#set_dont_use LHQD2
#set_dont_use LHQD4
#set_dont_use LHSND1
#set_dont_use LHSND2
#set_dont_use LHSND4
#set_dont_use LHSNDD1
#set_dont_use LHSNDD2
#set_dont_use LHSNDD4
#set_dont_use LHSNDQD1
#set_dont_use LHSNDQD2
#set_dont_use LHSNDQD4
#set_dont_use LHSNQD1
#set_dont_use LHSNQD2
#set_dont_use LHSNQD4
#set_dont_use LNCND1
#set_dont_use LNCND2
#set_dont_use LNCND4
#set_dont_use LNCNDD1
#set_dont_use LNCNDD2
#set_dont_use LNCNDD4
#set_dont_use LNCNDQD1
#set_dont_use LNCNDQD2
#set_dont_use LNCNDQD4
#set_dont_use LNCNQD1
#set_dont_use LNCNQD2
#set_dont_use LNCNQD4
#set_dont_use LNCSND1
#set_dont_use LNCSND2
#set_dont_use LNCSND4
#set_dont_use LNCSNDD1
#set_dont_use LNCSNDD2
#set_dont_use LNCSNDD4
#set_dont_use LNCSNDQD1
#set_dont_use LNCSNDQD2
#set_dont_use LNCSNDQD4
#set_dont_use LNCSNQD1
#set_dont_use LNCSNQD2
#set_dont_use LNCSNQD4
#set_dont_use LND1
#set_dont_use LND2
#set_dont_use LND4
#set_dont_use LNQD1
#set_dont_use LNQD2
#set_dont_use LNQD4
#set_dont_use LNSND1
#set_dont_use LNSND2
#set_dont_use LNSND4
#set_dont_use LNSNDD1
#set_dont_use LNSNDD2
#set_dont_use LNSNDD4
#set_dont_use LNSNDQD1
#set_dont_use LNSNDQD2
#set_dont_use LNSNDQD4
#set_dont_use LNSNQD1
#set_dont_use LNSNQD2
#set_dont_use LNSNQD4
#set_dont_use MAOI222D0
#set_dont_use MAOI222D1
#set_dont_use MAOI222D2
#set_dont_use MAOI222D4
#set_dont_use MAOI22D0
#set_dont_use MOAI22D0
#set_dont_use MUX2D0
#set_dont_use MUX2D1
#set_dont_use MUX2D2
#set_dont_use MUX2D4
#set_dont_use MUX2ND0
#set_dont_use MUX2ND1
#set_dont_use MUX2ND2
#set_dont_use MUX2ND4
#set_dont_use MUX3D0
#set_dont_use MUX3D1
#set_dont_use MUX3D2
#set_dont_use MUX3D4
#set_dont_use MUX3ND0
#set_dont_use MUX3ND1
#set_dont_use MUX3ND2
#set_dont_use MUX3ND4
#set_dont_use MUX4D0
#set_dont_use MUX4D1
#set_dont_use MUX4D2
#set_dont_use MUX4D4
#set_dont_use MUX4ND0
#set_dont_use MUX4ND1
#set_dont_use MUX4ND2
#set_dont_use MUX4ND4
#set_dont_use ND2D0
#set_dont_use ND2D8
#set_dont_use ND3D0
#set_dont_use ND4D0
#set_dont_use NR2D0
#set_dont_use NR2XD0
#set_dont_use NR3D0
#set_dont_use NR4D0
#set_dont_use NR4D1
#set_dont_use OA211D0
#set_dont_use OA21D0
#set_dont_use OA221D0
#set_dont_use OA222D0
#set_dont_use OA22D0
#set_dont_use OA31D0
#set_dont_use OA32D0
#set_dont_use OA33D0
#set_dont_use OAI211D0
#set_dont_use OAI21D0
#set_dont_use OAI221D0
#set_dont_use OAI222D0
#set_dont_use OAI22D0
#set_dont_use OAI31D0
#set_dont_use OAI32D0
#set_dont_use OAI33D0
#set_dont_use OR2D0
#set_dont_use OR2D1
#set_dont_use OR2D2
#set_dont_use OR2D4
#set_dont_use OR2D8
#set_dont_use OR3D0
#set_dont_use OR3D1
#set_dont_use OR3D2
#set_dont_use OR3D4
#set_dont_use OR4D0
#set_dont_use OR4D1
#set_dont_use OR4D2
#set_dont_use SDFCND0
#set_dont_use SDFCND1
#set_dont_use SDFCND2
#set_dont_use SDFCND4
#set_dont_use SDFCNQD0
#set_dont_use SDFCNQD1
#set_dont_use SDFCNQD2
#set_dont_use SDFCNQD4
#set_dont_use SDFCSND0
#set_dont_use SDFCSND1
#set_dont_use SDFCSND2
#set_dont_use SDFCSND4
#set_dont_use SDFCSNQD0
#set_dont_use SDFCSNQD1
#set_dont_use SDFCSNQD2
#set_dont_use SDFCSNQD4
#set_dont_use SDFD0
#set_dont_use SDFD1
#set_dont_use SDFD2
#set_dont_use SDFD4
#set_dont_use SDFKCND0
#set_dont_use SDFKCND1
#set_dont_use SDFKCND2
#set_dont_use SDFKCND4
#set_dont_use SDFKCNQD0
#set_dont_use SDFKCNQD1
#set_dont_use SDFKCNQD2
#set_dont_use SDFKCNQD4
#set_dont_use SDFKCSND0
#set_dont_use SDFKCSND1
#set_dont_use SDFKCSND2
#set_dont_use SDFKCSND4
#set_dont_use SDFKCSNQD0
#set_dont_use SDFKCSNQD1
#set_dont_use SDFKCSNQD2
#set_dont_use SDFKCSNQD4
#set_dont_use SDFKSND0
#set_dont_use SDFKSND1
#set_dont_use SDFKSND2
#set_dont_use SDFKSND4
#set_dont_use SDFKSNQD0
#set_dont_use SDFKSNQD1
#set_dont_use SDFKSNQD2
#set_dont_use SDFKSNQD4
#set_dont_use SDFNCND0
#set_dont_use SDFNCND1
#set_dont_use SDFNCND2
#set_dont_use SDFNCND4
#set_dont_use SDFNCSND0
#set_dont_use SDFNCSND1
#set_dont_use SDFNCSND2
#set_dont_use SDFNCSND4
#set_dont_use SDFND0
#set_dont_use SDFND1
#set_dont_use SDFND2
#set_dont_use SDFND4
#set_dont_use SDFNSND0
#set_dont_use SDFNSND1
#set_dont_use SDFNSND2
#set_dont_use SDFNSND4
#set_dont_use SDFQD0
#set_dont_use SDFQD1
#set_dont_use SDFQD2
#set_dont_use SDFQD4
#set_dont_use SDFQND0
#set_dont_use SDFQND1
#set_dont_use SDFQND2
#set_dont_use SDFQND4
#set_dont_use SDFSND0
#set_dont_use SDFSND1
#set_dont_use SDFSND2
#set_dont_use SDFSND4
#set_dont_use SDFSNQD0
#set_dont_use SDFSNQD1
#set_dont_use SDFSNQD2
#set_dont_use SDFSNQD4
#set_dont_use SDFXD0
#set_dont_use SDFXD1
#set_dont_use SDFXD2
#set_dont_use SDFXD4
#set_dont_use SDFXQD0
#set_dont_use SDFXQD1
#set_dont_use SDFXQD2
#set_dont_use SDFXQD4
#set_dont_use SEDFCND0
#set_dont_use SEDFCND1
#set_dont_use SEDFCND2
#set_dont_use SEDFCND4
#set_dont_use SEDFCNQD0
#set_dont_use SEDFCNQD1
#set_dont_use SEDFCNQD2
#set_dont_use SEDFCNQD4
#set_dont_use SEDFD0
#set_dont_use SEDFD1
#set_dont_use SEDFD2
#set_dont_use SEDFD4
#set_dont_use SEDFKCND0
#set_dont_use SEDFKCND1
#set_dont_use SEDFKCND2
#set_dont_use SEDFKCND4
#set_dont_use SEDFKCNQD0
#set_dont_use SEDFKCNQD1
#set_dont_use SEDFKCNQD2
#set_dont_use SEDFKCNQD4
#set_dont_use SEDFQD0
#set_dont_use SEDFQD1
#set_dont_use SEDFQD2
#set_dont_use SEDFQD4
#set_dont_use SEDFQND0
#set_dont_use SEDFQND1
#set_dont_use SEDFQND2
#set_dont_use SEDFQND4
#set_dont_use SEDFQNXD0
#set_dont_use SEDFQNXD1
#set_dont_use SEDFQNXD2
#set_dont_use SEDFQNXD4
#set_dont_use SEDFQXD0
#set_dont_use SEDFQXD1
#set_dont_use SEDFQXD2
#set_dont_use SEDFQXD4
#set_dont_use SEDFXD0
#set_dont_use SEDFXD1
#set_dont_use SEDFXD2
#set_dont_use SEDFXD4
#set_dont_use XNR2D0
#set_dont_use XNR2D1
#set_dont_use XNR2D2
#set_dont_use XNR2D4
#set_dont_use XNR3D0
#set_dont_use XNR3D1
#set_dont_use XNR3D2
#set_dont_use XNR3D4
#set_dont_use XNR4D0
#set_dont_use XNR4D1
#set_dont_use XNR4D2
#set_dont_use XNR4D4
#set_dont_use XOR2D0
#set_dont_use XOR2D1
#set_dont_use XOR2D2
#set_dont_use XOR2D4
#set_dont_use XOR3D0
#set_dont_use XOR3D1
#set_dont_use XOR3D2
#set_dont_use XOR3D4
#set_dont_use XOR4D0
#set_dont_use XOR4D1
#set_dont_use XOR4D2
#set_dont_use XOR4D4
#set_dont_use ISOLOD1
#set_dont_use ISOLOD2
#set_dont_use ISOLOD4
#set_dont_use LVLHLD1
#set_dont_use LVLLHCD1
#set_dont_use LVLLHCD2
#set_dont_use LVLLHCD4
#set_dont_use LVLLHCD8
#set_dont_use LVLLHD1
#set_dont_use LVLLHD2
#set_dont_use LVLLHD4
#set_dont_use LVLLHD8
#set_dont_use LVLLHFACD1
#set_dont_use LVLLHFACD2
#set_dont_use LVLLHFACD4
#set_dont_use LVLLHFACD8
#set_dont_use LVLLHFAD1
#set_dont_use LVLLHFAD2
#set_dont_use LVLLHFAD4
#set_dont_use LVLLHFAD8
